Mojinnn/STM32F103_with_HAL/LAB3_HCMUT/Light_Traffic_FSM/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BUTTON_1_Pin GPIO_PIN_4
#define BUTTON_1_GPIO_Port GPIOA
#define BUTTON_2_Pin GPIO_PIN_5
#define BUTTON_2_GPIO_Port GPIOA
#define BUTTON_3_Pin GPIO_PIN_6
#define BUTTON_3_GPIO_Port GPIOA
#define Red_Led_Y_Pin GPIO_PIN_7
#define Red_Led_Y_GPIO_Port GPIOA
#define A_H_Pin GPIO_PIN_0
#define A_H_GPIO_Port GPIOB
#define B_H_Pin GPIO_PIN_1
#define B_H_GPIO_Port GPIOB
#define C_H_Pin GPIO_PIN_2
#define C_H_GPIO_Port GPIOB
#define EN3_Pin GPIO_PIN_10
#define EN3_GPIO_Port GPIOB
#define Yellow_Led_Y_Pin GPIO_PIN_8
#define Yellow_Led_Y_GPIO_Port GPIOA
#define Green_Led_Y_Pin GPIO_PIN_9
#define Green_Led_Y_GPIO_Port GPIOA
#define Red_Led_X_Pin GPIO_PIN_10
#define Red_Led_X_GPIO_Port GPIOA
#define Yellow_Led_X_Pin GPIO_PIN_11
#define Yellow_Led_X_GPIO_Port GPIOA
#define Green_Led_X_Pin GPIO_PIN_12
#define Green_Led_X_GPIO_Port GPIOA
#define Blink_Led_Pin GPIO_PIN_13
#define Blink_Led_GPIO_Port GPIOA
#define D_H_Pin GPIO_PIN_3
#define D_H_GPIO_Port GPIOB
#define E_H_Pin GPIO_PIN_4
#define E_H_GPIO_Port GPIOB
#define F_H_Pin GPIO_PIN_5
#define F_H_GPIO_Port GPIOB
#define G_H_Pin GPIO_PIN_6
#define G_H_GPIO_Port GPIOB
#define EN0_Pin GPIO_PIN_7
#define EN0_GPIO_Port GPIOB
#define EN1_Pin GPIO_PIN_8
#define EN1_GPIO_Port GPIOB
#define EN2_Pin GPIO_PIN_9
#define EN2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
